gdb.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-08 Sun 17:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>gnu debugger</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">gnu debugger</h1>
<p>
gdb is a useful debugger
</p>

<p>
for c segmentation faults, you may also want <a href="./asan.html">address sanitizer</a>
</p>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> useful commands</h2>
<div class="outline-text-2" id="text-1">
<p>
gdb has tons of commands. these are the ones i use most often.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">abbrev</th>
<th scope="col" class="org-left">command</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>r</code></td>
<td class="org-left"><code>run</code></td>
<td class="org-left">start execution, from the beginning</td>
</tr>

<tr>
<td class="org-left"><code>b</code></td>
<td class="org-left"><code>break</code></td>
<td class="org-left">create a breakpoint</td>
</tr>

<tr>
<td class="org-left"><code>d</code></td>
<td class="org-left"><code>delete</code></td>
<td class="org-left">delete a breakpoint or clear all breakpoints</td>
</tr>

<tr>
<td class="org-left"><code>s</code></td>
<td class="org-left"><code>step</code></td>
<td class="org-left">do one instruction</td>
</tr>

<tr>
<td class="org-left"><code>n</code></td>
<td class="org-left"><code>next</code></td>
<td class="org-left">step until the next line</td>
</tr>

<tr>
<td class="org-left"><code>f</code></td>
<td class="org-left"><code>frame</code></td>
<td class="org-left">show where you are in execution again</td>
</tr>

<tr>
<td class="org-left"><code>fin</code></td>
<td class="org-left"><code>finish</code></td>
<td class="org-left">step until the current funtion returns</td>
</tr>

<tr>
<td class="org-left"><code>l</code></td>
<td class="org-left"><code>list</code></td>
<td class="org-left">show the source code</td>
</tr>

<tr>
<td class="org-left"><code>p</code></td>
<td class="org-left"><code>print</code></td>
<td class="org-left">get the value of variable</td>
</tr>

<tr>
<td class="org-left"><code>bt</code></td>
<td class="org-left"><code>backtrace</code></td>
<td class="org-left">show the backtrace</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org0000001" class="outline-2">
<h2 id="org0000001"><span class="section-number-2">2.</span> debuginfod</h2>
<div class="outline-text-2" id="text-2">
<p>
gdb supports an automatic debug symbol downloading service called
debuginfod. this means you will usually not have to go search for a
package providing debug symbols for some library and restart your
debugging.
</p>
</div>
</div>
</div>
</body>
</html>
